AucHouse/Catalogs/Аукционы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Аукционы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонца</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусАукциона</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыАукциона</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

AucHouse/Enums/СтатусыАукциона.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>СтатусыАукциона</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Начат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

AucHouse/Catalogs/Аукционы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Аукцион = Справочники.Аукционы.НайтиПоНаименованию(Объект.Наименование);
	Пар = Аукцион.ПолучитьОбъект();
	Если Объект.ДатаНачала < ТекущаяДата() и 
		Объект.СтатусАукциона<>Перечисления.СтатусыАукциона.Начат Тогда
		Пар.СтатусАукциона = Перечисления.СтатусыАукциона.Начат;
		Пар.Записать();
	КонецЕсли;            
	Если Объект.ДатаКонца < ТекущаяДата() и 
		Объект.СтатусАукциона<>Перечисления.СтатусыАукциона.Завершен Тогда
		Пар.СтатусАукциона = Перечисления.СтатусыАукциона.Завершен;
		Пар.Записать();
	КонецЕсли;
КонецПроцедуры
